In [2]:
import pandas as np
filepath='classdetails.csv'

def readdata(filepath):
    return np.read_csv(filepath)



readdata(filepath)

  EmployeeName EmployeeId      Place College  mobilenumber
0     Harideep  AO0516633  Vinukonda     TEC    8886520096
1        Vijay  AO0516627  Proddutur    CBIT    1234567890

In [3]:
data=readdata(filepath)
data

  EmployeeName EmployeeId      Place College  mobilenumber
0     Harideep  AO0516633  Vinukonda     TEC    8886520096
1        Vijay  AO0516627  Proddutur    CBIT    1234567890

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
EmployeeName    2 non-null object
EmployeeId      2 non-null object
Place           2 non-null object
College         2 non-null object
mobilenumber    2 non-null int64
dtypes: int64(1), object(4)
memory usage: 160.0+ bytes

In [5]:
data.describe()

       mobilenumber
count  2.000000e+00
mean   5.060544e+09
std    5.410747e+09
min    1.234568e+09
25%    3.147556e+09
50%    5.060544e+09
75%    6.973532e+09
max    8.886520e+09

In [6]:
data.columns

Index(['EmployeeName', 'EmployeeId', 'Place', 'College', 'mobilenumber'], dtype='object')

In [7]:
data.values

array([['Harideep', 'AO0516633', 'Vinukonda', 'TEC', 8886520096],
       ['Vijay', 'AO0516627', 'Proddutur', 'CBIT', 1234567890]],
      dtype=object)

In [8]:
data

  EmployeeName EmployeeId      Place College  mobilenumber
0     Harideep  AO0516633  Vinukonda     TEC    8886520096
1        Vijay  AO0516627  Proddutur    CBIT    1234567890

In [11]:
data.set_index('Place',inplace=True)

In [12]:
data

          EmployeeName EmployeeId College  mobilenumber
Place
Vinukonda     Harideep  AO0516633     TEC    8886520096
Proddutur        Vijay  AO0516627    CBIT    1234567890

In [37]:
data.set_index('mobilenumber',inplace=True)

AttributeError: 'NoneType' object has no attribute 'set_index'

In [35]:
data

In [1]:
s="harideep"
print(''.join(reversed(s)))

peedirah